/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   print_hex.c                                        :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: myokono <myokono@student.42tokyo.jp>       +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2023/10/10 16:38:51 by myokono           #+#    #+#             */
/*   Updated: 2023/10/10 16:43:56 by myokono          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "ft_print.h"

int ft_print_hex(va_list args)
{
    char c = va_arg(args, int);
    // %cの処理をここに書く
    return 0; // 仮の戻り値
}